[{
        "subreddit": "cancer",
        "title": "Welcome to /R/Cancer, sorry you're here. Please read our sidebar before submitting any posts!",
        "selftext": "Hey all, please take a second to read our rules before making any post here. Specifically please don't ask us if you have cancer. We're not doctors and we can't diagnose you. This is a place for people who have already been diagnosed to find support and camaraderie. Thanks!",
        "upvote_ratio": 0.98,
        "ups": 214,
        "downs": 0,
        "score": -214
    },
    {
        "subreddit": "cancer",
        "title": "How Can I Help/Helpful Information Mega-Thread.",
        "selftext": "Hello /r/cancer subscribers and visitors, as you may imagine this subreddit is inundated with well-meaning, but misplaced, posts from people asking how they can help their uncle who is currently in the hospital have a better stay, or what kind of present they can get their cousin with cancer to cheer them up around the holidays. These are all things that those of us who are subscribed here can certainly provide insight into, but it becomes tedious when we are asked to do this fourteen times a week. \n\nAs such, this will serve as a stickied mega-thread for anyone to drop their ideas, tips, and helpful information into. These tips will then live on in perpetuity as a sticky post on the main page. **I WILL REMOVE ALL OTHER POSTS ABOUT THESE TOPICS.**\n\nSo, for one final time, please post any things you wish you had in your hospital room, any gifts you wish you got, and any ideas that can help people alleviate some of the suffering of those they know with cancer.",
        "upvote_ratio": 1.0,
        "ups": 71,
        "downs": 0,
        "score": 71
    },
    {
        "subreddit": "cancer",
        "title": "What’s it like to go through cancer treatment?",
        "selftext": "\n\n It’s something like this: one day, you’re minding your own business, you open the fridge to get some breakfast, and OH MY GOD THERE’S A MOUNTAIN LION IN YOUR FRIDGE.\n\nWait, what? How? Why is there a mountain lion in your fridge? NO TIME TO EXPLAIN. RUN! THE MOUNTAIN LION WILL KILL YOU! UNLESS YOU FIND SOMETHING EVEN MORE FEROCIOUS TO KILL IT FIRST!\n\nSo you take off running, and the mountain lion is right behind you. You know the only thing that can kill a mountain lion is a bear, and the only bear is on top of the mountain, so you better find that bear. You start running up the mountain in hopes of finding the bear. Your friends desperately want to help, but they are powerless against mountain lions, as mountain lions are godless killing machines. But they really want to help, so they’re cheering you on and bringing you paper cups of water and orange slices as you run up the mountain and yelling at the mountain lion - “GET LOST, MOUNTAIN LION, NO ONE LIKES YOU” - and you really appreciate the support, but the mountain lion is still coming.\n\nAlso, for some reason, there’s someone in the crowd who’s yelling “that’s not really a mountain lion, it’s a puma” and another person yelling “I read that mountain lions are allergic to kale, have you tried rubbing kale on it?”\n\nAs you’re running up the mountain, you see other people fleeing their own mountain lions. Some of the mountain lions seem comparatively wimpy - they’re half grown and only have three legs or whatever, and you think to yourself - why couldn’t I have gotten one of those mountain lions? But then you look over at the people who are fleeing mountain lions the size of a monster truck with huge prehistoric saber fangs, and you feel like an asshole for even thinking that - and besides, who in their right mind would want to fight a mountain lion, even a three-legged one?\n\nFinally, the person closest to you, whose job it is to take care of you - maybe a parent or sibling or best friend or, in my case, my husband - comes barging out of the woods and jumps on the mountain lion, whaling on it and screaming “GODDAMMIT MOUNTAIN LION, STOP TRYING TO EAT MY WIFE,” and the mountain lion punches your husband right in the face. Now your husband (or whatever) is rolling around on the ground clutching his nose, and he’s bought you some time, but you still need to get to the top of the mountain.\n\nEventually you reach the top, finally, and the bear is there. Waiting. For both of you. You rush right up to the bear, and the bear rushes the mountain lion, but the bear has to go through you to get to the mountain lion, and in doing so, the bear TOTALLY KICKS YOUR ASS, but not before it also punches your husband in the face. And your husband is now staggering around with a black eye and bloody nose, and saying “can I get some help, I’ve been punched in the face by two apex predators and I think my nose is broken,” and all you can say is “I’M KIND OF BUSY IN CASE YOU HADN’T NOTICED I’M FIGHTING A MOUNTAIN LION.”\n\nThen, IF YOU ARE LUCKY, the bear leaps on the mountain lion and they are locked in epic battle until finally the two of them roll off a cliff edge together, and the mountain lion is dead.\n\nMaybe. You’re not sure - it fell off the cliff, but mountain lions are crafty. It could come back at any moment.\n\nAnd all your friends come running up to you and say “that was amazing! You’re so brave, we’re so proud of you! You didn’t die! That must be a huge relief!”\nMeanwhile, you blew out both your knees, you’re having an asthma attack, you twisted your ankle, and also you have been mauled by a bear. And everyone says “boy, you must be excited to walk down the mountain!” And all you can think as you stagger to your feet is “fuck this mountain, I never wanted to climb it in the first place.”\n\n\n(these aren't my words but something I have read often the last few years and it handy for others to pass on if they can't find the words to answer the question themselves)",
        "upvote_ratio": 0.93,
        "ups": 46,
        "downs": 0,
        "score": 46
    },
    {
        "subreddit": "cancer",
        "title": "Chemo fog, 5 years later...",
        "selftext": "After 5 years cancer free, I still have chemo fog...which I'm starting to realizing is just a massive drop in my intelligence. I started out with 130 iq, just tested a few months ago again and its dropped down to 94 points. \n\nI'm devastated, usually numbers likes these don't mean much to me, but its affecting me daily. I feel stupid, slow and not worth anything. \n\nI'd like to hear your stories, about chemo fog or anything related.",
        "upvote_ratio": 0.86,
        "ups": 18,
        "downs": 0,
        "score": 18
    },
    {
        "subreddit": "cancer",
        "title": "does acute lymphoblastic leukemia patients develop chemo brain?",
        "selftext": "Iam 17 year old and was diagnosed with pre BALL on 17th march. Should I be worried about any adverse side effects like chemo brain.",
        "upvote_ratio": 1.0,
        "ups": 2,
        "downs": 0,
        "score": 2
    },
    {
        "subreddit": "cancer",
        "title": "Working/Driving after Radiation?",
        "selftext": "My father was recently diagnosed with stage 4 lung cancer. It's been a brutal shock to the whole family. He's going to start getting radiation treatment at the end of the week, and he'll be getting it for 10 days straight. He's wondering if he will be able to drive and/or go to work. He has an office job. Can anyone share their experiences with driving and working while  getting radiation treatment?",
        "upvote_ratio": 0.94,
        "ups": 12,
        "downs": 0,
        "score": 12
    },
    {
        "subreddit": "cancer",
        "title": "Starting Obdivo tomorrow morning. I know the possible side effects, but what are OTHER things you wished you knew before starting your immunotherapy?",
        "selftext": "",
        "upvote_ratio": 1.0,
        "ups": 6,
        "downs": 0,
        "score": 6
    },
    {
        "subreddit": "cancer",
        "title": "Chemotherapy",
        "selftext": "Hello everyone I need advice/ assurance words to help me. I started chemotherapy last week I’m almost done with my first cycle and since yesterday my body feels like I was beaten up by 10 people it hurts a lot every time I touch anywhere I can feel pain. I found out yesterday I have a blood clot any advice would help me out a lot I’m starting to getting stress out and that’s not what I need right now",
        "upvote_ratio": 1.0,
        "ups": 1,
        "downs": 0,
        "score": 1
    },
    {
        "subreddit": "cancer",
        "title": "Dad was diagnosed with Rectal Cancer on Friday.",
        "selftext": "Hey everyone! So my dad (57m) was diagnosed on Friday. It sounds like his tumor is on the larger size. He met with the surgeon on Friday and the surgeon sounds optimistic. I’m hoping he will get some tests this week or next. \n\nHe’s pretty upset, we have a decent relationship through my adult life although we don’t talk super often (once a week or every other week). I called him this morning, we chatted he has some concerns about maintaining the house, his rental houses and not everything fall on my mom while he’s going through treatment. He’s scared. I told him we will figure all that out and not to worry.\n\nWhat I really want to do is know how to best support him and my mom. She’s pretty upset as well understandably.\n\nSo I’d like to keep in touch with my parents and make sure they are ok. Would it be reasonable to make a point to call him everyday? Would he feel like I am overreaching? I don’t want him to feel like he needs to write a will because I’m calling him so much but I really want to be there to hear his concerns and i don’t think he will reach out himself. I live in about an hour away, I plan to hire out or do their lawn care myself this year. My parents are well off so money isn’t so much of a issue but what can I do for them?",
        "upvote_ratio": 0.96,
        "ups": 22,
        "downs": 0,
        "score": 22
    },
    {
        "subreddit": "cancer",
        "title": "Tips for minimizing hair loss?",
        "selftext": "Do things like shampooing/conditioning in the shower less often, or using dry shampoo instead, help to minimize the loss? Or is it going to be inevitable due to the interaction between the chemo + hair follicles?\n\nI've been experiencing hair thinning, which isn't super noticeable at a quick glance (and I would like to keep it that way!). I wasn't given much direction from my doctor in part because he didn't think I'd have much loss to begin with. So all info, perspectives, product recommendations, etc. are appreciated!",
        "upvote_ratio": 1.0,
        "ups": 6,
        "downs": 0,
        "score": 6
    },
    {
        "subreddit": "cancer",
        "title": "Dad starts his first round of chemo on Friday",
        "selftext": "I posted on here about a month ago that my dad was diagnosed with pancreatic cancer. Today we met with his oncologist to discuss the results of the biopsy they did, and following the installation of a Hickman line he will be starting his first round of chemotherapy this Friday. I wish I could be there to sit with him through it but I can't take off of work; my mom will be with him so he won't be alone, but I hate that I can't be there to hold his hand\n\nThankful for this sub for giving me a place to vent and for all the support\n\nHoping this is the first step towards a successful recovery",
        "upvote_ratio": 0.9,
        "ups": 7,
        "downs": 0,
        "score": 7
    },
    {
        "subreddit": "cancer",
        "title": "Two months after my dad’s battle with Melanoma",
        "selftext": "The timeline:\n\nTwo and a half years ago: My father (78 years old when he passed) had blood in his urine. He was diagnosed with bladder cancer, which lead to two stays in the hospital because he was a bit cavalier in his treatment (BST) and lived alone. During this time he also had a stage 1 melanoma removed. Because of the chaos around his bladder cancer (and trying to avoid covid), the melanoma was thought to be dealt with.\n\nDecember 18, 2021: I was making my Christmas visit (I’m his only child) and we went out to dinner. I had noticed over the last year that walking up any sort of incline was increasingly difficult. During the drive home I noticed a lot more hesitancy in his driving. It was nighttime post-dinner. He revealed to me that he had difficulty seeing the stoplights and while stopped at an intersection he said he saw five stoplights where there were only four. I told him he shouldn’t drive at night anymore, he agreed.\n\nDecember 19: I wake before him and fix my breakfast. I notice he is taking longer than usual to emerge from his bedroom. When he finally comes out he looks visibly shaken. He reveals that he just experienced something like a seizure. He was unable to move the left side of his body and his left arm was jerking uncontrollably. He was better once it stopped. Looking back I should have taken him to the hospital immediately, but it was just as the Omicron surge was hitting and going to an emergency room was more ill advised than normal. Also my dad really didn’t want to go back to a hospital. I told him he really needed to get this checked out. Another complication was it was Christmastime, and his primary care doctor retired in October. He didn’t really have relationship with his new doc yet.\n\nDecember 20: He tells me he will get a head MRI on January 6. Over the next two weeks he reports no additional seizures. He also doesn’t want me telling anyone in his life about this.\n\nJanuary 6, 2022: MRI. He texts me the MRI notes from the hospital. They are looking for a possible stroke.\n\nJanuary 7: Hospital instructs him to immediately drive to the hospital to get checked in and have a body MRI. “This might be a big bite” he texts me.\n\nJanuary 8: Doctors reveal to him that he has stage 4 Melanoma, which has spread to his lungs, liver, and brain. He also reveals he has a lump on his chest. Because this day is his 78th birthday the doctors do not quite impress on him the gravity of his situation. He thinks it’s treatable and agrees to immediate radiation and immunotherapy.\n\nJanuary 10: He begins ten days of radiation therapy. He will lose his hair. He keeps telling me “I think I’m going to beat this.”\n\nJanuary 12: I sit him down to talk about what he wants done if he passes, he’s not entirely ready to engage in this conversation. At this point he is still able to walk short distances and feed himself. He still wants to live in his home, which he purchased just the May before, alone. The doctors have told him no more driving, which he agrees to.\n\nJanuary 14: He gets a ride to the hospital for treatment and in the process loses his wallet. He asks me numerous times if I have taken it.\n\nJanuary 16: I make the two hour drive to look for his wallet in his house and fail to find it. This was not a fun trip. We order a replacement credit and bank card. It’s a bad time to lose his insurance card.\n\nJanuary 18: Meet with the immunotherapy doctor. She lays out the three month immunotherapy schedule and wants my father checked in to the hospital, and then have him moved into assisted living. She says she will set this up. I say “do I need to do anything?” She says no, it will be taken care of. Great I think, because splitting time from my home and at my dad’s is getting difficult.\n\nJanuary 19: Go to hospital for radiation with bags packed to be checked in. On arrival it turns out… nothing has been prepared for him to stay in the hospital and there is no space in the hospital for him. Immunotherapy doctor won’t return multiple calls (turns out it will be 15 days before she will finally return a call). This day has me in a panic. Assisted living homes are either full or infected with Covid. Along with melanoma my father also has Pulmonary Fibrosis. While he is fully vaccinated avoiding Covid is critical for him. After many calls I get an appointment with an in-home care service.\n\nJanuary 20: In-home care has initial visit. They are responsibly run and recommend 24 hour care given his situation. Dad talks them down to 8 hours of care a day. He still likes his independence. They can start care on January 25. He just has to last until then I think.\n\nJanuary 24: He is supposed to get a ride to his last radiation therapy, but he never makes it. He is found on the floor of his house and paramedics are called. He thinks he tried to sit on the toilet and missed. I later see that he probably fell in the kitchen. He is admitted to the emergency room. Given the Covid situation I am not able to enter the ER. He ends up spending three days in the hospital. I observe him try to walk for the last time while being tested by the physical therapist. He can walk about four steps. This makes his blood pressure go down. He has had low blood pressure for years now. The lack of blood pressure is why he fell.\n\nJanuary 27: Dad is released from the hospital but they won’t let me drive him home. He comes home in an ambulance strapped to a stretcher. In-home care has been increased to 24 hour care. Immunotherapy is still scheduled somehow (and the doctor still hasn’t returned a call) . I start asking what doctors I can speak to (and it’s been a wild assortment of doctors now, most I speak to only once) if he should be in hospice care. None give me a definitive answer.\n\nJanuary 31: A hospital bed is rented for his home, as he has fallen out of his bed a couple times now. I make the decision to have him evaluated for hospice care and the nurse admits him. This makes things better, as now nurses will start visiting on almost a daily basis. Dad still thinks he is going to recover. I can’t bear to tell him what is happening.\n\nFebruary 2: I finally hear back from the immunotherapy doctor. I yell at them.\n\nFebruary 3: Dad has had significant hearing loss since his 20’s and has worn a hearing aid. The swelling in his head is so bad now that he can’t insert his hearing aid anymore, rendering him essentially deaf. I can only communicate with him now by typing things out on the notes app on my iPhone. He wants to hire a doctor so he can walk again. Using the notes app I tell him all we can do is make him comfortable. I have a long cry.\n\nFebruary  4: A hospice social worker tells me to go home, because I am on the verge of cracking. Dad is now getting morphine injections. Hospice is a godsend. I spend the weekend at home away from all of this.\n\nFebruary 7: Come back. Dad is moaning from the pain. Morphine injections are eventually increased to every 90 minutes, with Ativan given regularly now as well. He is not eating or talking. I decide to stay until the end.  Getting preloaded morphine syringes is difficult. Twice we had the hospice’s pharmacy have them delivered via taxi after hours. Opiate laws are more stringent now.\n\nFebruary 9: An old friend of his that I haven’t seen since my childhood comes by to say goodbye.\n\nFebruary 11: Dad passes away peacefully.\n\nCODA\n\nApril 2: I find the wallet that he lost on the floor of his garage.",
        "upvote_ratio": 0.9,
        "ups": 15,
        "downs": 0,
        "score": 15
    },
    {
        "subreddit": "cancer",
        "title": "Husband's pathology is back...",
        "selftext": "Grade 4 glioma. Survival rate is not good for his age.",
        "upvote_ratio": 0.86,
        "ups": 10,
        "downs": 0,
        "score": 10
    },
    {
        "subreddit": "cancer",
        "title": "Does anyone else use their cancer to get out of things yet still feel bad about it?",
        "selftext": "So I have had it reletiveley easy with my MM. I was diagnosed in Jan 2021 with stage 3 MM. Got put on chemo shots and pills for 4-5 months with no real side effects. In June 2021 had my stem cell transplant an the worst issue I had was some neuropathy in my feet/legs for a few weeks. Recivered for 6 months and when everything checked out with my MM in remission I went back to work.\n\nSince then every month and half or so I'll wake up for work and just not feel like going and call in for 2-4  days. And use my cancer as an excuse, medication side effect issue, shots issue. \n\nI know mental health days are as important to take as sick days but that doesnt stop me from feeling guilty about calling in but also feeling guilty doesnt stop me from calling in. I guess since this is still new from me (it's only been 15 months since I was diagnosed) I was looking for how to get over the guilty part or to see if I was taking \"advantage\" of my situation since I am relatively healthy. Any thoughts? Thanks.",
        "upvote_ratio": 0.78,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "Melanoma Diagnosis &amp; Absolutely Terrified",
        "selftext": "Several weeks ago, I asked my dermatologist to shave a mole on my thigh that I’ve had forever. It had never changed, dermatologists have always said it looked perfectly healthy, but I just was tired of it rubbing on my pants. It came back positive for melanoma which was shocking. I feel like I haven’t been able to breathe since I found out. \n\nThe path report says 1.2MM at least, mitosis rate of 2, non-ulcerated. I talked to my derm again today &amp; mentioned how confused I was that it was melanoma since it’s never changed. She talked to the pathologist again this morning who looked at the slide again and the path told her that the mole itself was actually healthy and the melanoma arose next to it. The pathology report is clear that the specimen they received is 1MM depth and the depth of the melanoma extends to the wide and lateral margins. I asked for clarification because they just shaved the mole and not any of the surrounding skin and she said that the path said that a new “mole” aka melanoma grew up next to the original mole and that it was “separated by a dimple”. Mind you, I’ve never seen any changes in it. My derm says it’s fine that none of that was in the pathology report, including the type of melanoma. But for some reason, I feel uneasy about it. The pathologist it was sent to isn’t in my city and it’s a small one person clinic. \n\nAdd to that, I just have this crushing feeling of paralyzing worry. My dermatologist said that she feels confident that it hasn’t spread to my lymph nodes but I’m absolutely terrified. I’m envisioning being given 6 months to live. I’m 33 &amp; have two young kids and I’ve been crying all day today just envisioning not seeing them grow up. The thought of having to wait longer for surgery and pathology makes me want to throw up.",
        "upvote_ratio": 0.86,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "My father is refusing further treatment for his stage 4 Cancer of unknown Primary. Please tell me what I should do with the time I’ve left with him.",
        "selftext": "He’s 51, 52 next week. Onco tells him he’s got months if he doesn’t continue treatment. He says the brain fog and rampant gagging/digestive issues really diminish the joys he derived out of life. His staminas shot.\n\nWe’ve a good relationship. He’s prideful and has always cared well for my sister and I. He’s two sisters overseas, one of whom he’s close with. I love him dearly and would do anything just to wind back the fucking clock 3 years to when he was carefree and IT-obsessed and fiercely independent.\n\nCancers dug into his liver and hasn’t yet been found elsewhere. It first presented in his spine when it shattered 3 vertebrae and gave him the worst pain he’s ever felt. PTSD to boot. He got rods to stabilize his spine and chemo/radiation which did resolve the spine tumors but he started this journey with a huge loss and it really colored every interaction since.\n\nHe wants to live out his days in Chicago where we lived some time ago, and hopefully die in Geneva Switzerland where he grew up. We’re just spitballing about enjoying his time but these are the persistent ideas he toys with.\n\nPlease tell me what to do now that I won’t be able to do later. Tell me what I’ll regret not doing before he passes.",
        "upvote_ratio": 0.92,
        "ups": 22,
        "downs": 0,
        "score": 22
    },
    {
        "subreddit": "cancer",
        "title": "I didn’t know it would drag out for forever",
        "selftext": "I don’t know where else to put this but I’m sleep deprived and at my wits end. My mom has stage four renal cancer. And it’s time. I flew in Saturday morning, my brothers and I all said goodbyes and she said her piece to us and her dearest family and friends. She looked at the doctor and said I want to fall asleep and it be over. And that’s not how it works. I never thought much about the end stage. My only other experience with this- it was quick with how affected that family member was. But my mom? She’s strong. She’s so strong and the thing is no matter how ready she is my little brother and I are camped out in her room with her while she is still gasping for breath and on palliative care. She has the morphine pump that we have to fight and time on our phones when to beg the nurses for the next dose since they are so overwhelmed and short staffed so she does not wake up from her sleep choking and trying to make herself comfortable. She’s not scared I can see it. But she’s upset. She’s angry. She wants to go and see her dad and leave us to grieve and it’s day 4 in the hospital and we can’t get a straight answer on how much longer this is going to continue. She’s only 62. She was so healthy. This cancer has already taken so much from us and now she can’t even pass with dignity and we have to wait for nature to take its course while I sob every time she chokes or sputters if the medicine doesn’t hit on time or it’s time for one of the timed whatever’s. She’s fought a good fight. And while I honestly never thought she wouldn’t beat it… we are all ready. She deserves peace. So my baby brother and I will continue to watch her and be here for her while our dad takes one night to go home and collect himself before he rejoins us in our vigil.\n\nEDIT: My amazing mother passed away at 12:25 PM 4/11. Thank you everyone. My eyes are open not only to the impact of cancer but how we handle palliative care and what we need to change.",
        "upvote_ratio": 0.95,
        "ups": 33,
        "downs": 0,
        "score": 33
    },
    {
        "subreddit": "cancer",
        "title": "Has anyone here ever taken Keytruda+Inlyta combo for Renal Cell Carcinoma? Did you have any nasty side effects? My father just started on this a couple days ago. Good so far, but we still would like to have an idea of what to expect. Thanks.",
        "selftext": "",
        "upvote_ratio": 1.0,
        "ups": 1,
        "downs": 0,
        "score": 1
    },
    {
        "subreddit": "cancer",
        "title": "Is non-chemo \"Cancer Fog\" a real thing? Need advice",
        "selftext": "My wife had a bout with melanoma 4 years ago.  She had surgery, but no chemo.  She has had no recurrences of cancer, but did have a strange yearlong period where she lost weight \"For no reason\" but has since gained weight back.\n\nIn the first 18 months after her surgery she had anxiety about cancer.  This was real and I know she was dealing with issues from it.  \n\nAt the beginning of COVID her cancer anxiety faded, but she was left with a \"Cancer Fog.\"  This is a point of great contention / argument between us, but she is NOT the same as she used to be.  She is mildly slow on the uptake, slow to react to danger or stress,  mostly incapable of thinking or acting quickly.  She is not \"ditzy.\"   There is nothing air-headed here.  It's like we have a conversation and she continually thinks other people saying the most basic things, like she misses every nuance.  \n\nSample quote.  My teenager says, \"French Fries are really very 'Murican.\"  And she responds, \"French Fries are not really from France, they're from Belgium.\"  And we're left scratching our heads, like, did you hear what we said?  The majority of conversations every day end in arguments, often because she tries to correct others or \"teach\" them about topics mostly unrelated to anything that was said.  This isn't air-headed, it's much more obtuse, but it happens every single day.\n\nNaturally when this first happened, she started getting in trouble at work and was eventually fired in Summer 2020.  Since then, she's been unable to find anyone who will hire her.  The few times I've heard her do phone interviews, she doesn't seem to understand the questions and bombed.  Those are only the interviews I've heard.  All I can say is that it appears she misinterprets most discussions and seems to \"dumb them down\" but I swear that none of this ever happened before cancer.\n\nIs there such a thing as non-Chemo Cancer Fog?  Is there a treatment for this?",
        "upvote_ratio": 1.0,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "Mouth Sores… advice?",
        "selftext": "I had my first round of chemo this last Tuesday, and today the mouth ulcers are horrible. Anyone have some home remedies or OTC meds to recommend?",
        "upvote_ratio": 1.0,
        "ups": 27,
        "downs": 0,
        "score": 27
    },
    {
        "subreddit": "cancer",
        "title": "helping neuropathy?",
        "selftext": "",
        "upvote_ratio": 0.75,
        "ups": 2,
        "downs": 0,
        "score": 2
    },
    {
        "subreddit": "cancer",
        "title": "Has anyone done BEAM for HL?",
        "selftext": "Did 6 cycles of ABVD and didnt work so now my doc is suggesting either immunotherapy + BEAM + stem cell trans or chemo + BEAM + stem cell trans. Memorial Sloan has an immunotherapy + chemo + 1 yr maintenance immunotherapy as a clinical trial or as standard treatment immunotherapy + chemo + BEAM + stemm cell +’1 yr maintenance.\n\nDont really wanna do BEAM so im thinking of that trial. If anyone has done BEAM, how bad is it?",
        "upvote_ratio": 1.0,
        "ups": 2,
        "downs": 0,
        "score": 2
    },
    {
        "subreddit": "cancer",
        "title": "Tomorrow I have an mri to determine if chemo worked.",
        "selftext": "",
        "upvote_ratio": 0.95,
        "ups": 70,
        "downs": 0,
        "score": 70
    },
    {
        "subreddit": "cancer",
        "title": "G-tube... Your stories? Advice?",
        "selftext": "I have Head &amp; Neck Squamous Cell Carcinoma. I'm actually at the tail end of 3 surgeries, chemo and radiation... \n\nBut it's compounded on affecting my taste. I can barely drink water and no food or nutritional drinks anymore because it literally tastes like poison and my body reacts that way.\n\nI decided I don't want an NG tube,  plus it likely would be too long for an ng anyway.  I had one for 1.5 days after surgery and I worked so hard to get nutrition in despite pain because the tube was making it worse. \n\nMy dad (physician) told me G-tubes aren't really that radical or invasive like I thought. But I'm still anxious about it.\n\nAnything I need to know? I'll likely not get my taste back for anywhere from 3 to 6 weeks. Is that too short of a time for a g-tube? I still have room to lose weight as I was pretty overweight, but obviously this is a bad way for my body to do it. I've already lost 20 lbs but probably shouldn't lose much more. \n\nWhat's your experience? Thanks.",
        "upvote_ratio": 0.88,
        "ups": 6,
        "downs": 0,
        "score": 6
    },
    {
        "subreddit": "cancer",
        "title": "Support for my aunt?",
        "selftext": "Hi everyone, my aunt (74F) just had her entire lung removed due to cancer. It has been traumatic/devastating, since she’s no longer eligible for her long-dreamed lung transplant. She’s doing poorly, and I’m hoping some kind words will cheer her up. If you’d like to send her a card, please message me for her address. Thanks!❤️",
        "upvote_ratio": 0.89,
        "ups": 7,
        "downs": 0,
        "score": 7
    },
    {
        "subreddit": "cancer",
        "title": "Welp, Neuroendocrine Tumor of the Appendix",
        "selftext": "Hi everyone! Well, I’m new here and I’m grateful to find a community in this where I hopefully won’t feel so alone. \n\nA little over a month ago on March 7th I had an elective bilateral salpingectomy for the only reason of sterilization. However, I woke up to the news that they had also performed a surprise appendectomy. I had endometriosis in an ovary, lining of my bladder and my uterus…and also what they thought was in my appendix. I had a severe delayed allergic reaction to the medical adhesive, and multiple times my sutures rejected through my skin. I was already emotionally done with this and ready to get back to normal life. \n\nAfter pathology came back 4 days after surgery, it turns out that it wasn’t endo. It was a 2.9cm G1, well-differentiated neuroendocrine tumor on my 5cm appendix. As far as I was aware, the margins were negative, it was removed and that was that. They referred me to a colorectal surgeon to go over pathology further. \n\nWelp, that appointment was on April 6th and it sure did go sideways quick. I was told that the cancer was also on the connective tissue and that I needed a colonoscopy, a scan to stage my cancer and regardless of the results an very high suggested right hemicolectomy. \n\nMy scan is scheduled for the 18th and needless to say I’m having a rollercoaster of emotions. I am a otherwise healthy 28 year old woman, happily divorced for two years and just opened my small business. I feel like my world is just being crushed before I have barely lived in it. I guess more than anything, I just needed to vent about it, not feel so alone and don’t want to tell anyone but my family as I don’t have any answers to provide to friends who I know will be concerned.",
        "upvote_ratio": 0.96,
        "ups": 17,
        "downs": 0,
        "score": 17
    },
    {
        "subreddit": "cancer",
        "title": "chemo day one did not go as planned",
        "selftext": "I started chemo yesterday. Paclitaxel and carboplatin for stage IVB endometrial cancer. About 30 seconds into the paclitaxel infusion I went into severe anaphylaxis. Scariest thing ever. Code, rescue meds, and two hours later my oncology team decided to forgo the paclitaxel and just do carboplatin. That went much better. Next time they're giving me docetaxel instead of the paclitaxel. Anyone else have this experience? I'm told its fairly common. Did you react better to the docetaxel?",
        "upvote_ratio": 1.0,
        "ups": 25,
        "downs": 0,
        "score": 25
    },
    {
        "subreddit": "cancer",
        "title": "frustrated",
        "selftext": "i did chemo from august 2021 to january 2022, then had a bilateral mastectomy in february. pathology has run so many tests on samples taken both before chemo and on the tumor removed during surgery, almost always coming back inconclusive on my HER2 result. i was meant to start radiation next week, then i get a call from my oncologist on Friday saying that the latest results came back as HER2+. now i have to postpone radiation and other treatment so i can go through another 4 cycles of chemo given over 12 weeks. i’m angry because my family and i thought i was done with this part, that i only had 5 weeks of radiation and then i’d be on maintenance until further notice. now i feel like i’m back to square one and feeling a little hopeless.",
        "upvote_ratio": 0.89,
        "ups": 12,
        "downs": 0,
        "score": 12
    },
    {
        "subreddit": "cancer",
        "title": "[Oral/Head/Neck Cancer] Removed lymph nodes- what side effects have you noticed?",
        "selftext": "Hello! I'm 5 months from my partial glossectomy which removed T2 SCC tumor from my tongue and a MRND which took 50 lymph nodes.   \nMy first post-op scans came back clean (!!!!) and aside from some minor issues with my tongue and the 'will it come back' lingering in the back of my mind, things are probably the best-case scenario and I'm super thankful I was persistent and caught this early.   \n\n\nI've written before about some of my dissatisfaction in my new double chin, which I know could also be a lot worse, but hey I'm a girl in my 30's and live in LA (so I guess am a little vain). I was on a plane for the first time since surgery last week and I definitely noticed I was way more swollen -\\_- (I did about six weeks of meeting with an occupational therapist that specializes in lymphatic massage back in December/January, but she felt there wasn't much more she could do with weekly visits. I've tried the head bandage which I didn't notice a difference except discomfort in how I held my jaw sleeping), I've been told to just be patient and it will get better in another six months or so. \n\nMy question is if you've had many lymph nodes removed in your neck- have you noticed any changes/side effects that you can't connect to anything else? There's been a heatwave in LA this week so it literally could just be me getting older/it being damn hot/misremembering, but it's really taken it out of me and I don't recall ever feeling this way before. I was doing yard work this morning (mostly bent over) and I almost felt like I was going to pass out and got really light-headed. Just wondering if this may be related to the lack of nodes or if anyone has noticed anything else odd.",
        "upvote_ratio": 0.86,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "Squamous Cell &amp; Lobectomy…. What should I expect after surgery?",
        "selftext": "",
        "upvote_ratio": 1.0,
        "ups": 4,
        "downs": 0,
        "score": 4
    },
    {
        "subreddit": "cancer",
        "title": "What kept your spirits high when you first started going through treatments?",
        "selftext": "I’ve been hospitalized now for a few weeks, feels like months. I think I’ll get discharged eventually, but the other, morbid part of my brain tells me otherwise. Being here gives me a lot of time to live in my head, which before I could muffle by being a very active.\n\nPersonal fuck you to Snapchat for sending “Guess where you were three years ago!” Notification as I’m typing this lol.\n\nResponses could be specific to you and doesn’t need to be generic advice for everyone. I could use a feel good cancer story right now.",
        "upvote_ratio": 0.85,
        "ups": 13,
        "downs": 0,
        "score": 13
    },
    {
        "subreddit": "cancer",
        "title": "Chemo brain",
        "selftext": "I’m so thankful for everything my doctors did to keep me alive. \n\nI had horrible ADHD before cancer, it was ruining my life. \n\nI had to undergo 3 allogenic stem cell transplants and gamma knife, and now I feel like the chemo brain , ontop of crippling adhd , is just absolutely insane. \n\nIt’s been about a year and a couple months since I’ve had any chemo, and everything just feels so hard. I was working part time and going to college part time before cancer, and now that all feels like a pipe dream. \n\nI wish I never got cancer, I wish I could focus like a normal person. Cancer took so much from me, I just want to feel like the person I used to be , but I know that is unrealistic. \n\nAtleast I’m alive!",
        "upvote_ratio": 0.97,
        "ups": 27,
        "downs": 0,
        "score": 27
    },
    {
        "subreddit": "cancer",
        "title": "What are things you can say to someone suffering from cancer to life their spirits?",
        "selftext": "",
        "upvote_ratio": 0.67,
        "ups": 1,
        "downs": 0,
        "score": 1
    },
    {
        "subreddit": "cancer",
        "title": "72 year old Mom had successful lumpectomy and is deciding 1 week radiation or not",
        "selftext": "Hi all. My Mother had what the docs are calling a very successful lumpectomy, and they say cancer free (still need a ct scan next week). She is on a very small dose chemo pill of sorts. At first they were saying 4-5 weeks of radio therapy. But now its down to one week. The numbers given to my Mom are 10-15% chance of it coming back without radiation (and staying on that pill) or 3-5 with. She is considering not taking the radiation, due to her age and other health probs (heart palp and chronic bronchitis). I'm a little worried though..., you wonderful people, do you think this is a wise decision?",
        "upvote_ratio": 0.71,
        "ups": 4,
        "downs": 0,
        "score": 4
    },
    {
        "subreddit": "cancer",
        "title": "I had my last appointment before being 5 years cancer free and I don't know how to feel.",
        "selftext": "In December 2016 I was diagnosed with cancer, in August 2017 I finished treatment. The past years have been difficult and scary. Weeks before my cancer screens I would get anxious and the last two times were the worst. Yesterday I had my last screen until September, one month after my five year anneversary and I don't know how to feel.\n\nBeing five years cancer free has always been my dream and now, for the first time, it is actually within reach. I'm graduating high school (or the equivalent of high school in the country I life in) this summer after not knowing if I ever would. \nIt all feels so overwhelming but I just can't get myself to be happy about it now. Everytime I think of being five years cancer free I think of everyone who wasn't. All the other children of the hospital and my family members who died of cancer. And then all I feel is guilt. I feel bad for being happy about it, inconsiderate and I don't know what to do. It's weird because I always used to look forward to it and be hopeful but now I'm not anymore. Instead, I wonder if the people around me think about why I get to be five years cancer free and their loved ones don't.\n\nSomehow, even after having finished treatment so long ago, after the cancer got out of my body, it still won't get out of my mind.",
        "upvote_ratio": 1.0,
        "ups": 20,
        "downs": 0,
        "score": 20
    },
    {
        "subreddit": "cancer",
        "title": "Oddly specific question",
        "selftext": "Hello all.\n\nSo I currently live in Japan, and one of the reasons my prognosis here has been so dark is because immunotherapy does not exist here. Well it does, but it’s not covered by insurance, so prohibitively expensive.\n\nSo after feeling down about things for a while, I realized I’m being dumb. I’m not Japanese, I’m a Canadian! So I found out that in the province I’m from, I can get treated as soon as I land despite the fact that I have been gone for more than a decade. For free (yay Canada!)\n\nThe only thing is that this is all things I’ve read. So I’m wondering if anyone has experienced coming back to Canada for emergency treatment? Was it easy/difficult? Sorry if this isn’t allowed, I’m just really hoping this is plausible.\n\nIn the meantime I’ll ask my Japanese doctor at my next appointment if my prognosis would improve if I could get immunotherapy and watch his head explode.",
        "upvote_ratio": 0.83,
        "ups": 7,
        "downs": 0,
        "score": 7
    },
    {
        "subreddit": "cancer",
        "title": "Has Anyone Here Been Operated on By Seth Harlow at UVM Medical center?",
        "selftext": "TW: Surgical Malpractice\n\nI was referred to him in my 20s and recently found out that students did the surgery, possibly without supervision. From all reports it should have been a curable cancer, but I've been left with a grossly disfiguring, highly visible scar and a paralyzed vocal cord. According to other surgeons, Harlow (or whoever performed the surgery under his name) made such dangerous, reckless mistakes that the cancer the residual cancer they left behind is in danger of taking my ability to speak and swallow in the future. :( Harlow was also dishonest about if I still had cancer, which caused delays in treatment. \n\nAfter speaking with several attorneys, they said that there is functionally no recourse because:\n\n\\- Vermont judges are protective of doctors\n\n\\- Vermont doesn't recognize the loss of chance doctrine, which legal scholars say is an important patient protection. Without this, or a patient death, it is \"virtually impossible\" for cancer patients to recover damages in Vermont. \n\n\\- I also reported him to the medical board, but the medical board still hasn't acknowledged the complaint. As far as I know, he's still practicing as the chief of Surgical Oncology. \n\n\\- I know of exactly one person who was satisfied with his surgical care. She was a lawyer. When I called her to ask for help, she said \"but he operated on me, and i'm fine, so you must be fine, right?\" \n\n\\- He supposedly operated on my friend too, who passed away at 35 following complications. I see negative reviews of him pop up periodically on google, but they are quickly removed. When I posted in the Vermont subreddits, the post was quickly brigaded and removed. Has anyone else seen him and had similar experiences?",
        "upvote_ratio": 0.56,
        "ups": 1,
        "downs": 0,
        "score": 1
    },
    {
        "subreddit": "cancer",
        "title": "My dad's mental state is a mess, what could it be?",
        "selftext": "He's been diagnosed with stage IV lung cancer. For stage 4, its actually not that bad, and only slightly outside of ONE lung.\n\nThe family has said multiple times they will respect his wishes and he has the final say. However, they repeat this to him so often I begin to question the sincerity.\n\nAnyways, dad's mental state has taken a turn for the worse. He:\n\n1. constantly forgets things (every other word, the name of his daughter, the name of his doctor, where he is, schedules etc)\n2. rambles on in circles about needing to put together a taskforce and compile information for his treatment\n3. insists he can walk down to the shops for cigarettes and chocolate cake (he can't walk unassisted and knows it) and has had a few falls this way\n4. Insisted my sister and I were interested in having sex with each other (we're not) and begged us not to. Again and again.\n5. Pulls off his oxygen tube without realizing it. Again and again. \n6. Psychologically torments us and calls us cruel for denying him cigarettes, but then insists he wants to get ready for lifestyle changes and treatment. \n7. Complains he is tired and wants to sleep any time I bring this up.\n\n&amp;#x200B;\n\nI'll be honest, my relationship with dad isn't great, and unless he's dead or dying, I'm not too concerned. I have promised him I will carry out his wishes, I'm just not sure whether I can even trust him any more.\n\nThe MRI showed his brain is clear of cancer. Is it really just depression that's causing his mind to spiral like this? What can I do to help bring him back to reality and get a clear picture of what HE wants. Otherwise, I fear the rest of the family will just do what they want.",
        "upvote_ratio": 0.91,
        "ups": 9,
        "downs": 0,
        "score": 9
    },
    {
        "subreddit": "cancer",
        "title": "Nivolumab With PD-L1/IDO Peptide Vaccine Shows Efficacy in Metastatic Melanoma",
        "selftext": "Can someone put this into layman's terms for me?  What even is a Phase 1/2 study? I thought that all the studies were completely separate entities ? What is median overall survival?  \n\n\n\\&gt;At the December 1, 2021, data cutoff date, updated results from the  trial showed that among 30 efficacy evaluable patients the overall  response rate (ORR) was 80%, and 47% of patients achieved a complete  response (CR). At a median follow-up of 2.7 years, the median  progression-free survival (PFS) was 25.3 months, and the median overall  survival (OS) was not reached  \n\n\n[https://www.targetedonc.com/view/nivolumab-with-pd-l1-ido-peptide-vaccine-shows-efficacy-in-metastatic-melanoma](https://www.targetedonc.com/view/nivolumab-with-pd-l1-ido-peptide-vaccine-shows-efficacy-in-metastatic-melanoma)",
        "upvote_ratio": 1.0,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "Mom stopped taking cancer meds and needs to sleep",
        "selftext": "My mom was diagnosed in December with stage 4 cancer. They matched the dna of the cancer to a gene targeted drug that prevents the cancer from growing. She was reluctantly taking the medication for several months now. It likely has been working.\n\nIn this time she has declined physically and mentally. (Likely hereditary undiagnosed bipolar mania ) She has delusions that she is doing well when her family sees the opposite. She is in bed most of the time and barely eats anymore. But she has been sleep deprived for months now. Like just a few hours of sleep in a 24 hour cycle.\n\nthis week, in a bout exuberance (could be delusion) she has decided to follow a holistic method of treatment. She decided to stop taking the cancer drug. \n\nShe needs to sleep but vehemently refuses all western medicine and over the counter sleep aids aren’t working.\n\nWe don’t know what if anything we can do as a family. It just hurts to watch. I cried today realizing that I can’t just pick up the phone and call my mama on the phone.\n\nI miss my mom.",
        "upvote_ratio": 0.95,
        "ups": 19,
        "downs": 0,
        "score": 19
    },
    {
        "subreddit": "cancer",
        "title": "Research Study: Perceived Injustice and Mental Health outcomes in Cancer Patients",
        "selftext": "Hi everyone,\n\n\nI have posted previously to recruit participants for our study about the feeling of unfairness and its influence on mental health in cancer patients. However, we are still in need of more participants so we would highly appreciate it if you could consider taking part.\n\n\nExperiences of injustice can arise at different stages throughout the cancer disease - when the patient is confronted with the feeling of \"why me?\" after the initial cancer diagnosis (e.g. they have never engaged in any bad lifestyle choice that could have led to cancer), the case of cancer recurrence or in relation to experiences in the hospital (e.g. surgical complications, infections).\nPeople deal differently with those feelings of unfairness and for some individuals this could contribute to symptoms of depression which have been associated with problematic recovery and treatment outcomes in cancer patients. Our study tries to understand IF there is a connection between experiences of injustice and mental health, WHAT this tells psychotherapists in the treatment of depression in psycho-oncology and HOW experiences of injustice could be prevented in the first place.\n\n\nIf you would like to contribute to this piece of research, are over the age of 18 and have or have had cancer, we would highly appreciate it if you could fill out this survey (10-15 minutes) -\n\nhttps://ucdpsychology.qualtrics.com/jfe/form/SV_3dZjc1b70vsHAmG\n\n\nThank you so much in advance and I wish you all the best.\nLuisa",
        "upvote_ratio": 1.0,
        "ups": 3,
        "downs": 0,
        "score": 3
    },
    {
        "subreddit": "cancer",
        "title": "Alternatives to smoking weed so I can save my lungs?",
        "selftext": "Hey guys, my oncologist told me I have to quit smoking bc the chemotherapy will be bad for my lungs so they have to be as healthy as possible when I start (around may 1st)\n\nI’ve been smoking 2-3 joints a day for 2 years bc of mental health issues and I’m going to see a psychiatrist to see what I can do but I’ve been really scared to quit bc my emotions can be really extreme and I’m alone a lot of the time. Weed is legal here but edibles are a lot harder to find so I wanted to see if there’s more alternatives.",
        "upvote_ratio": 1.0,
        "ups": 6,
        "downs": 0,
        "score": 6
    },
    {
        "subreddit": "cancer",
        "title": "Why does my husband have such terrible neuropathy in his fe",
        "selftext": "So I know I post on people's comments a lot about my husband's neuropathy in his feet but the doctors don't really have an answer why he has it and what can be done about it. My husband has stage 4 metastatic melanoma and he started out with tumors in his lungs, liver, brain, femur, and on his tail bone. He did immunotherapy like yervo and something else and it worked really well and pretty much shrunk everything down. \n\nHowever, there where some breakthrough tumors and he developed one on his spine and it cause some sciatica nerve pain on his right side. However, he did radiation and that shrunk it down a bit and it's not growing or doing anything. However, ever since then he has had painful, awful neuropathy in his feet and the oncologist doesn't really seem to have an answer on how to get rid of it, what's the cause, what are some pain management he can use for it. He referred us to a pallative care guy and he prescribed gabapentin but it didn't do anything. \n\nHe referred us to a neurologist who was useless. We had to wait three months to be seen and then when we finally made it to the appointment, she had no idea why we were there and had to leave the appointment in the middle of it to pull up his file and CT scans to take a look at his medical records. Like she was really unprepared. She did some EMG test where they shocked his legs with electric impulses and then she told him that the neuropathy was from the tumor on his spine and the immunotherapy drugs (well no shit).  She prescribed him Lyrica now but all that does is make him dizzy. \n\nDoes anyone have any recommendations on what we could try? My husband's quality of life is really suffering. He said if he could get the tingling, pins and needles out of his feet the cancer would almost be manageable. I feel like the doctors are just like \"Yeah, that sucks.\"",
        "upvote_ratio": 0.91,
        "ups": 17,
        "downs": 0,
        "score": 17
    },
    {
        "subreddit": "cancer",
        "title": "Anyone dealing with cancer again (for a second time or more)? Super Survivors?",
        "selftext": "Having survived a widespread bone cancer quite a few years ago, I was always scared of a second diagnosis. Now that my fears are materializing I don't quite know what to feel...\n\nThis time is totally different from last, but it's hard to commit to treatment knowing how rough it was before... especially chemo.  \n\nSo, I'd love stories from other folks who have gone through multiple rounds of cancer and treatment. What sucked? What helped? What keeps you going?",
        "upvote_ratio": 1.0,
        "ups": 11,
        "downs": 0,
        "score": 11
    },
    {
        "subreddit": "cancer",
        "title": "My boyfriend recently got diagnosed w non Hodgkin’s lymphoma and is having night sweats",
        "selftext": "Hi sorry if this is badly typed grammar wise I’m trying (fake names and all that )\n\nMy boyfriend (m 22) Michael just got diagnosed with B cell non Hodgkin’s lymphoma in February roughly. And Michael runs hot naturally before he got sick. My question is do any of you know what is the best electric sleep pad for our queen sized bed. Anything you would recommend to help with sweats especially during super hot summers thanks in advance",
        "upvote_ratio": 0.86,
        "ups": 9,
        "downs": 0,
        "score": 9
    },
    {
        "subreddit": "cancer",
        "title": "I need some help navigating the heath system. I feel like a lost ship on a pitch black ocean.",
        "selftext": "What do you do when your care team feels more like a 3 ring circus then actual Doctors office.",
        "upvote_ratio": 0.67,
        "ups": 2,
        "downs": 0,
        "score": 2
    },
    {
        "subreddit": "cancer",
        "title": "Recent Melanoma Diagnosis",
        "selftext": "I went to my dermatologist for a skin check because I have the BRCA2 mutation which slightly increases the risk of melanoma. I asked her to shave a mole that I’ve had on my thigh for at least 15 years. I’ve had several derms look at it &amp; they always said it looked like a healthy, pink mole. Shave biopsy came back as melanoma which was shocking. \n\nPathology report shows that it’s at least 1.2mm deep, non-ulcerated, 2 mitosis/mm2. Based on the pathology, the dermatologist felt that it was caught early and sent me to a surgical oncologist to have it excised and I opted to do a lymph node biopsy as well. \n\nI’m honestly just still in shock. Could melanoma have been slowly growing on my leg for 15 years? Or did it turn cancerous at some point recently? I’m obviously terrified that it’s spread to my lymph nodes and I’m looking for any positive melanoma stories to calm my nerves.",
        "upvote_ratio": 0.86,
        "ups": 13,
        "downs": 0,
        "score": 13
    },
    {
        "subreddit": "cancer",
        "title": "Sad and scared for my mom",
        "selftext": "Hi everyone, my mom was diagnosed with leiomyosarcoma about 2 years ago. She went through a hysterectomy to remove her large tumor in her uterus before they had found that it spread to her lungs. She’s undergone “the red devil” treatment (something with doxorubicin I think), which ultimately wasn’t working well enough and she was pulled from the trial. She started a targeted chemo pill and immunotherapy in January, but she will not be continuing with that any more. Her tumors have continued to grow under that treatment and she just feels awful. Exhausted. Like she can’t do anything. It was worse than the other treatment, which she wasn’t expecting — her body just could not tolerate it.\nWe’re taking a trip to Europe, just her and I, in a couple of weeks. It’s always been her dream, so my family and I came together last year and got her this trip. She’s SO excited, as am I, and I’m so happy that this has been giving her something to look forward to. She’s not doing any treatment until after the trip, and is looking at another treatment with 2 chemo pills. The other option is traditional chemo. I will always want what’s best for her, but I’m so scared that she’s going to start letting go after this trip. My mom and I are extremely close, and this whole process has been heartbreaking. I know there’s nothing I can do, and I just want to support her, and I know this cancer will likely be what she succumbs to, but god. It’s just so hard. I can’t imagine her not in my life. \nThis isn’t so much a question or anything, but more me venting. This fucking sucks. I don’t want her to give up, but I also don’t want the treatment to be worse than the cancer, which this one was. I still have hope for the next treatments, as we all do. It’s just been a lot harder these last few weeks. I’m planning on making visits (surprises and planned ones). Is there anything else I can do for her? \nI love her so much, and it just literally pains me seeing her this way. Is there any advice from caregivers/family members on how you kept your mental health more positive and just overall dealing with deteriorating situations?",
        "upvote_ratio": 0.73,
        "ups": 6,
        "downs": 0,
        "score": 6
    },
    {
        "subreddit": "cancer",
        "title": "Genetic diseases?",
        "selftext": "I’m 29M and have been diagnosed with osteosarcoma and clear cell renal cell carcinoma. Just curious if anyone else has had similar and found something in their genetic testing. I was tested for Li fraumani syndrome and was not a match.",
        "upvote_ratio": 0.79,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "Journalist request: Anyone who was supposed to be in a clinical trial that got delayed by Covid?",
        "selftext": "Hi, I'm a journalist and advocate/ caregiver (to a parent with cancer). I'm writing an article about delays and disruptions in clinical trials because of the pandemic, and would like to hear from people (either people with cancer or caregivers) about their experiences with this, either in 2020 or later. If you're able to share your experience, please leave a comment or message me. Thank you.",
        "upvote_ratio": 0.4,
        "ups": 0,
        "downs": 0,
        "score": 0
    },
    {
        "subreddit": "cancer",
        "title": "I’m just heartbroken over how much cancer and being disabled because of cancer has affected my life.",
        "selftext": "I don’t know if it’s okay to just rant on here, but if it’s okay with the mods, I’d like to. I might even delete this in the morning. \n\nEverything is hard because I have a hard time letting people in. I lost contact with all my friends after I got cancer, and even after I finished treatment, no one wanted to actually be there for me anymore. School was hard. Getting more surgeries, alone, was hard. Now I don’t even know how to socialize that well without making everything awkward. It all feels forced and painful, and I don’t even like to tell anyone my medical history because they get that ‘aw you had cancer?’ face, and their voice goes like ten octaves higher and it gets completely weird and I start wondering how to make them more comfortable so I don’t feel so bad. Even though I’m the one that went through it. \n\nI’m angry I lost a lot of time hating myself and idealizing the possibility of not surviving because I just felt so lonely for so long. And my personal life got even shittier after I finished treatment because why not throw that in too, on top of almost dying (twice) and becoming disabled. And now that things seem to be picking up, I feel like I’m waiting for the other shoe to drop. This is going to be my ninth year since finishing chemotherapy and I still feel like this. I feel like at any point I’ll just go back to that hospital room with the smell of disinfectant hitting me while three doors down, and those sheets that made me sweat, with the stupid, ugly marble vinyl floors and that one awkward armchair pushed into the far corner. \n\nI’ve avoided follow up appointments for the past three years because of COVID and overall not wanting to go back to the hospital, but I have a follow up appointment scheduled in a few weeks and all I want to do is scream and cry because I hate the thought of going back there for this. I didn’t realize just how much it was making me feel this way until I broke down on my drive home from class. I’ve been crying on and off since. \n\nI just hate cancer for doing this to me, I hate negligent doctors for making my experience so much worse, and I hate the fact I have to worry about this at the ripe, old age of 25 when everyone else, it seems, is getting to live a normal life. I just hate it all.",
        "upvote_ratio": 0.93,
        "ups": 37,
        "downs": 0,
        "score": 37
    },
    {
        "subreddit": "cancer",
        "title": "Anyone else hates drinking water?",
        "selftext": "I used to drink lots of water but ever since the chemotherapy the water tastes different and I can barely drink enough.any tips?",
        "upvote_ratio": 0.94,
        "ups": 29,
        "downs": 0,
        "score": 29
    },
    {
        "subreddit": "cancer",
        "title": "I’m confused as to why I take chemo pills?",
        "selftext": "I’m diagnosed with a high grade inoperable glioma. I’m guessing I.V hits stronger. Given that it’s high grade and inoperable I excepted to get chemo therapy through I.V but I take chemo pills. Shouldn’t my doctors want to give me the stronger chemo",
        "upvote_ratio": 0.91,
        "ups": 15,
        "downs": 0,
        "score": 15
    },
    {
        "subreddit": "cancer",
        "title": "Who else has leukemia here?",
        "selftext": "Had ALL seven years ago, diagnosed at 5, who else is with me?",
        "upvote_ratio": 0.94,
        "ups": 15,
        "downs": 0,
        "score": 15
    },
    {
        "subreddit": "cancer",
        "title": "Chemotherapy",
        "selftext": "It’s been 4 days since I started chemotherapy and the fatigue is getting worse to the point all I can do is sleep the only time I’m awake is to use the bathroom should I ask my doctor to give me something for it. My whole body is aching and I feel tired with no energy to even go for a walk. Any advice would help.",
        "upvote_ratio": 0.97,
        "ups": 23,
        "downs": 0,
        "score": 23
    },
    {
        "subreddit": "cancer",
        "title": "How do you manage your anxiety?",
        "selftext": "Sometimes I feel short of breath for days, plural. My blood pressure always spikes at each appointment because I’m just terrified I’ll get more bad news. If I wake up in the middle of the night, welp, I’m just up then, there is no going back to sleep. Sometimes I can distract myself, but this constant low grade panic and inability to breathe is getting *exhausting*.",
        "upvote_ratio": 0.85,
        "ups": 19,
        "downs": 0,
        "score": 19
    },
    {
        "subreddit": "cancer",
        "title": "7 years since diagnosed, les go!",
        "selftext": "I had leukemia, the ALL varient, and it's been 7 years since I was diagnosed with cancer!",
        "upvote_ratio": 0.96,
        "ups": 33,
        "downs": 0,
        "score": 33
    },
    {
        "subreddit": "cancer",
        "title": "i can literally feel my new tumors and them growing this sucks",
        "selftext": "(29) (f) stage 4 melanoma. i’ve been off treatment for 4 months cause i’ve been on such high dose steroids due to severe autoimmune side effects from immunotherapy. i didn’t have any mets up until about literally 2 weeks ago (that i could feel) and now i feel some and see some and i can feel them and literally see them getting bigger. all of my new mets are subcutaneous (just had spine mets before but just had a procedure for those) and i felt 2, went in to my oncologists, had a petscan, and i actually have 7. the two i felt are literally growing by the days it’s fucking terrifying. and i’m starting to be able to feel the other ones. i’m starting targeted therapy as soon as insurance and such calls me and gets it going stat. so hopefully that helps but jesus it’s fucked up to being seeing these grow so damn fast and not being able to do anything right now. needed to vent and just feeling lousy. hope y’all are doing a little better. argh..",
        "upvote_ratio": 1.0,
        "ups": 84,
        "downs": 0,
        "score": 84
    },
    {
        "subreddit": "cancer",
        "title": "Friends wife just told me to get over myself…",
        "selftext": "Hi, I finished treatment (6 months of chemo and 3 surgeries so far) for breast cancer in October… tonight my partner wanted to go out to dinner with a friend of his and this friend’s partner… we were all talking about how my dad had taken part of a fundraiser that I had (very wearily) put on to help with living expenses and how one business wanted a photo of me with one of those giant vulgar checks,  to donate to said fundraiser… friend’s partner interrupted me and went off on a tangent about how I should *be* so lucky, and how people *die* from cancer and how people have it *much* worse than myself… neither my partner or his friend said anything. I’m irate. I’ve never had someone be so disrespectful or exhibit such a lack of concern or interest in what I’ve gone through. I didn’t know where else to go to rant. My partner doesn’t really seem to understand. I was so deeply concerned with expressing my gratitude throughout the fundraising process and wrote hundreds of handwritten thank-you letters in addition to the regular social media updates and thank-yous I had posted.",
        "upvote_ratio": 1.0,
        "ups": 43,
        "downs": 0,
        "score": 43
    },
    {
        "subreddit": "cancer",
        "title": "My Dad's Cancer Story",
        "selftext": "My dad (64) was diagnosed with stage 4 colon cancer in late December of 2020. He had no symptoms other than dull stomach and back pain and constipation. He received a stoma and has a colostomy bag since. At the time of diagnosis it had already spread to his liver, lungs, and lymph nodes. He completed 6 months of intensive chemo, it was rough but he tolerated it fairly well. There was significant shrinkage of all tumors and no spread during treatment. He began chemo pills and a palliative infusion that was just once every three weeks for maintenance and the cancer grew slowly. The infusion caused stomach bleeding that filled his colostomy bag with blood so then he just took pills. In November of 2021 the cancer continued to progress and he had targeted radiation on the lung lymph nodes and Y90 radioembolisation to his liver around Christmas. This caused his lips and mouth to swell severely, I believe he may have been allergic to some degree. Neither of these things worked, perhaps they caused the cancer to spread faster. In February he was accepted to complete in a research trial for an immunotherapy drug, it took a month to qualify which meant lots of tests and then had two rounds before his scan revealed significant growth in all areas as well as spread to the urinary tract and heart. Today, he moved to hospice care. He is still walking (a struggle), eating (very little), and is himself (unless taking anxiety meds which cause some confusion). I am very much heartbroken and I pray every day that they can stop this monster of a disease from eating people alive. \n\nI remember searching for other people's stories at the beginning of and throughout my dad's cancer journey because it helped me find comfort in knowing others experiences, so I wanted to share his story because I don't have anything to search for anymore. The few times I've posted here has helped a lot.",
        "upvote_ratio": 1.0,
        "ups": 22,
        "downs": 0,
        "score": 22
    },
    {
        "subreddit": "cancer",
        "title": "please answer honestly.",
        "selftext": "what are your thoughts on patients who wish to discontinue treatment?",
        "upvote_ratio": 1.0,
        "ups": 21,
        "downs": 0,
        "score": 21
    },
    {
        "subreddit": "cancer",
        "title": "This sucks.",
        "selftext": "Just got the results of my PET test back today. Stage 4. We’re moving on to chemotherapy, but the doctor said it’s at best a way to extend what time I have left, it’s unlikely to fix anything. I don’t even feel anything - I was hospitalized for a week last year during which time they decided to look further. I seriously don’t feel sick, although I suppose that’ll change.\n\nFuck cancer.",
        "upvote_ratio": 0.99,
        "ups": 79,
        "downs": 0,
        "score": 79
    },
    {
        "subreddit": "cancer",
        "title": "Ssdi questions",
        "selftext": "On March of this year I found out about ssdi and contacted a lawyer to help me apply for it. And last week I got approved for ssdi. My ALL diagnosis started on June 7 so on the document it says that I’m entitled to benefits starting from December 2021 to now. My first benefit comes in on April but it states that it will be the amount for that month only. Am I just not going to receive the other amount from December to March that I’m entitled because I submitted my application too late? This is my first time applying for any kind of assistance whatsoever so some advice would definitely help.",
        "upvote_ratio": 0.83,
        "ups": 4,
        "downs": 0,
        "score": 4
    },
    {
        "subreddit": "cancer",
        "title": "Please help us.",
        "selftext": "We need all the advice we can get, honestly. My Aunt is 50 years old and she has stage 4 Adenocarcinoma of the lung. It’s spread throughout her entire body (honestly it would probably be easier to name the places the cancer hasn’t spread— I know her heart is one of the organs it hasn’t spread to, and potentially her brain too). It’s in pretty much all of her bones. She was only diagnosed last month, and before that she was a perfectly healthy 50 year old woman. It’s mind blowing to all of us how it could spread this fast and this intensely. As of last week, we were planning on chemo starting tomorrow, and she’d done radiation on her sternum, spine and hip. However, over the weekend she fell and broke her leg. It’s determined that she’s too weak to undergo chemo now, so we made the decision today to take her home and begin hospice care. She’s on private insurance, I think either Anthem or Aetna, and she’s hit her deductible and out of pocket max. \n\nSo, here are my questions. Any help would be so incredibly appreciated. \n\n1. Apparently we’ll only be able to get a nurse/aide into the house 4-5 times a week for an hour at a time. We desperately need help the rest of the time. I asked the hospice person today— do you know any companies who can help out? She didn’t. We can’t afford to pay privately for care. Does anyone know of any places where we can get additional support for her? She’s totally bedbound and can barely even move.\n\n2. What happens next? I really want to be prepared. How long do we have with her? How does this progress? What will ultimately take her? I’m just so mindfucked by all of this and how one month she can be fine and then the next month she’s a shell of herself. \n\nI think that’s all for now, but I’m sure I’ll have more questions as we go along. Thank you so much in advance!!",
        "upvote_ratio": 1.0,
        "ups": 11,
        "downs": 0,
        "score": 11
    },
    {
        "subreddit": "cancer",
        "title": "Prostate cancer metastasized to spine",
        "selftext": "I just have a question as I've learnt by now it's better to hear it from professionals or people's experiences rather than scare myself with Dr. Google. \n\nBasically my dad was diagnosed with prostate cancer 15 years ago now. At the time they removed his prostate with surgery but there was still cancer so they did radiation. A while later they began hormone treatment where he's been having hormone injections for many years now depending on his PSA levels. Little things have come up during this time but overall they've never been able to pinpoint where the cancer is as it wouldn't show up on scans until a few weeks ago when his PSA levels jumped a significant amount. \n\nHis latest scans have shown there is cancer on a few places of his spine, he will do radiation and he said that should suppress it for maybe 6 months but that's all he will say atm. He's always pretty optimistic for our families benefit and I don't like to bombard him with questions because he's always vague so I was wondering if anyone has any personal experience with this as I'm terrified his time is running out. I would like to know if people can survive this and if this is going to cause him much pain as he never tells us when he's hurting and works long hours and is always doing things around the house and outside for our family.\n\n I am very grateful he has lived 10 years longer than he was told he would and feel selfish being so distraught when other people have it so much worse but my mum got breast cancer in 2020 and is also on hormone treatment after chemo and radiation and it just feels like they aren't catching a break. I like to be realistic and would like to gain a better understanding of what will be happening next for him so I can deal with my emotions quickly personally and be there for them. \n\nThank you in advance if you are able to share some insight and sorry I don't have more information to be clearer.",
        "upvote_ratio": 1.0,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "Chemotherapy day 3",
        "selftext": "I started chemotherapy on Monday and today is my 3 day for anyone who has done chemo already or is going through it right now what are some symptoms have you experienced, what are some snacks do you be eating while doing the chemo, what are some advice for someone young like me who is going through this hard time.",
        "upvote_ratio": 1.0,
        "ups": 12,
        "downs": 0,
        "score": 12
    },
    {
        "subreddit": "cancer",
        "title": "Anyone have any tips for getting rid of metallic taste in mouth?",
        "selftext": "",
        "upvote_ratio": 0.91,
        "ups": 8,
        "downs": 0,
        "score": 8
    },
    {
        "subreddit": "cancer",
        "title": "Mom got diagnosed with Gallbladder cancer",
        "selftext": "Hi all,\n\nMy 60 year old mom got diagnosed with gallbladder cancer. It is most likely stage 3. It has spread to the base of her liver, a lymph node and a nearby blood vessel. We had been to the ER to get her checked out for bloating issues. There they discovered a 20 cm mass on her ovary and a 5 cm mass in the gallbladder fossa. She had the ovarian tumor removed a few days back. The doctors have said that the gallbladder tumor is inoperable right now. The doctors are waiting for her biopsy to come back before letting us know the course of action. But it is likely going to be chemo and/or radiation to see if the tumor shrinks. If it does, then they might do the tumor resection followed by another round of chemo.\n\nFrom my online reading, it doesn't seem like there is much hope. The doctors have said she might have 2-3 years to live. The studies I could find only help prolong her life by a few months. I am just wondering if anyone here has any experience with this and any recommendations on what we can do. We are willing to travel for treatment as long as the cost is not outrageous. My mom is in Mumbai, India while I am in the US.",
        "upvote_ratio": 1.0,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "Boost white cells",
        "selftext": "Couldn’t have my infusion as WBC count was too low. Any suggestions for food that helps them increase? Thx",
        "upvote_ratio": 1.0,
        "ups": 14,
        "downs": 0,
        "score": 14
    },
    {
        "subreddit": "cancer",
        "title": "Mother in law with cancer",
        "selftext": "Hey guys! So my mother in law just got out of the hospital from her cancer removal surgery, while she’s healing she has been staying with my wife and I in our one bedroom apartment. I was curious as to what care we can request for her, or any help you guys would recommend. She’s on bed rest, feeding tube inserted into her gastric system because she can’t move her mouth or swallow well. Her other children and family refuse to help and won’t even visit because they’re too busy. My wife and I both work time consuming jobs and this happened so suddenly we weren’t prepared. I’m not sure to ask for an at home nurse or what. My wife and I are super lost and it’s destroying us with work and trying to help her mom. If you guys have any advice I’ll read everything, reply while i can at work! Thanks",
        "upvote_ratio": 0.83,
        "ups": 4,
        "downs": 0,
        "score": 4
    },
    {
        "subreddit": "cancer",
        "title": "SCC Right tonsil T3 N2b Mx (toxicity grade iii/iv)",
        "selftext": "Hi everybody. My 70 year old dad was diagnosed with SCC of his right tonsil in February 2021. (Symptoms since November 2020) There is no mention in his records of HPV and he was an extremely heavy drinker and smoker, hasn't smoked since symptoms started and very very rarely has a beer now.\n\nWhile waiting for scans and treatment to start he struggled to swallow anything and lost massive amounts of weight, he was just above 6 stone at his worst and after I forced the issue and rang an ambulance they put in a NG tube for food, water and some medication. \n\nHe moved in with me and started what should have been 33 doses of radiation. It hit him so hard, a lot of this was because he was so weak from weight loss and he had multiple long stays in hospital so the radiation took months to complete. \n\nFast forward and they booked a PET scan but they booked it under the assumption his treatment would be long completed but in actual fact was only 2 weeks post completion. They said it was inconclusive. Eventually a CT scan in January showed something in his saliva gland and a biopsy confirmed SCC, this is now very visible just looking at him. \n\nThey initially offered surgery or chemo, he chose surgery then the day before they said they couldn't operate and offered intensive 5 day inpatient chemo or less intensive once a week for an undetermined amount of weeks, he chose intensive....today he went in for bloods before starting and they changed their mind again! \n\nHe is gutted but very quiet about it and does not advocate for himself. He is to start Erbitux (Cetuximab) on 12th April and I have no idea what to expect, we have an extra problem as we are English living in Spain, he was on holiday here with me (I live here) when he was diagnosed. He is getting special dispensation to stay here for treatment even without having residency which I am beyond grateful for. But every appointment is through a translator and I know I am not getting all the info I should to be able to advocate for him. \n\nI have some experience with cancer/oncology as I was a clinical coder in UK so I know if we were in England I would know what to ask and who to speak to as he would be treated in the hospital I worked at but here I feel massively out of my depth. (I offered him the choice to go home for treatment at multiple times throughout this and he always refuses he is adamant he wants to stay in Spain). The hospital is over an hour away from us and our car is off the road so he also has to rely on ambulance transfers which he hates but \nI can't do anything about that.\n\nWhat can he expect and what can I expect as his carer? I haven't been told about any sort of cancer care team for him and even if I did it would have to be through his translator. He is registered with a GP but hasn't actually met them more than a couple of times and they don't exactly provide a great support network. \n\nHis oncologist today just said he might get some skin problems and if he gets a fever to take him to emergency.\n\nI wasn't prepared for the radiotherapy side effects but after that experience I know I'm not being fully informed here and would like any and all advice or recommendations people might have. I don't even know how long each infusion is they just said it depends!! \n\nThank you for any advice.",
        "upvote_ratio": 0.81,
        "ups": 3,
        "downs": 0,
        "score": 3
    },
    {
        "subreddit": "cancer",
        "title": "Just received my diagnosis... what now?",
        "selftext": "I (26M) have a large rhabdomyosarcoma in the muscle of my left thigh. It has spread to the bone marrow in my femur and the doctors saw a 3mm nodule in my right lung that they suspect is malignant as well. I have a compression fracture on my L2 vertebra and I'm having back spasms from that and can't get very comfortable.\n\nI first felt the lump at the beginning of December, when it was about 2cm, and now it has grown to about 13cm. I have an appointment tomorrow with an orthopedic oncologist, but I won't be able to get in to see the radiology oncologist until the 18th (I'm trying to get it moved up). I've had ultrasounds, MRIs, CT scans, going in for a PET scan soon. All of my blood work has been very normal, not showing any abnormal levels for anything. And the only things of note from my scans are mentioned above. \n\nI'm told that I'm going to be undergoing radiation and chemo, but not until after I meet with rad onc on the 18th. I can't believe that I just have to sit with all this for that long. \n\nNothing sounds good to me. Movies, food, even Disneyland wouldn't be fun right now. \n\nI'm scared. I don't want to die. I don't want to leave my girlfriend and our families with all of this pain and sadness. I know that's probably the wrong thing to focus on, but I can't help it. \n\nMy mom keeps talking about homeopathic stuff that cured my uncle (He didn't even get a biopsy, he's Qrazy). I will not be rejecting any actual medical guidance in favor of homeopathic alternatives, but is there anything natural (other than cannabis) that eased your radiation and/or chemo?\n\nI guess I'm just looking for some advice. How do I stay positive? What can I do in the meantime before my appointment on the 18th to prepare myself and my body for radiation and chemo?\n\nIf my situation sounds similar to yours and you've made it through, first of all, congratulations. And second, please share your and help me find a little hope, or even just get my mind off this for a while. \n\nThank you all in advance.",
        "upvote_ratio": 0.96,
        "ups": 32,
        "downs": 0,
        "score": 32
    },
    {
        "subreddit": "cancer",
        "title": "Need info about friend chemo",
        "selftext": "Hi everyone, I have a friend that is diagnosed with AML. She is 31 year old an in the moment of diagnose she was pregnant, baby was born in 28th week and everything is fine with little one.\n\nThis week she will be treated with second dose of chemo and doctor therapy of choice is CLAG-M. So now we try to collect information about this therapy. \n\nMy questions are:\n- is anyone here treated with CLAG-M therapy for AML to share experience here?\n- how cadribine reflects on this therapy (most common problems that is caused by cladribine to you)?\n- is there any natural supstances/food/drink that can help her and do her life less painful in this period?\n- is there any workout that can help do her life less painfull in this period? \n- was this therapy effective for you?",
        "upvote_ratio": 1.0,
        "ups": 2,
        "downs": 0,
        "score": 2
    },
    {
        "subreddit": "cancer",
        "title": "Advice on how to feed a patient?",
        "selftext": "My dad has stage 4 lung cancer caused by 30 years of heavy smoking. On top of that, he's always had very bad eating habits. He's always been extremely picky and refuses to eat homemade meals. Before cancer, he bought an entire bucket of fried chicken weekly, and Whoppers maybe every other day. Instant ramen was every dinner, ignoring food on the table. He only eats food from restaurants or heavily processed desserts.\n\nAfter starting chemo, he really eats maybe once or twice a day. If you ask him to eat anything homemade, he throws an insane tantrum. If you tell him you bought him a double cheeseburger, he eats it and all the fries with a smile. After watching his diet for the past two months, he's eaten a homemade meal probably less than 10 times.\n\nObviously, this isn't healthy, but what the hell do I do? He's in late-stage cancer, and I don't want to make what may be the last of his remaining life to be unnecessarily stressful; but if he doesn't like it, he'll starve until he finds something he does.\n\nWe've had doctors and nurses tell him to eat properly, but he never changes his ways. Do I stop enabling him by buying him what he wants? Or is there a kind of etiquette around this that I need to learn?",
        "upvote_ratio": 0.92,
        "ups": 17,
        "downs": 0,
        "score": 17
    },
    {
        "subreddit": "cancer",
        "title": "Mom seems to have gone crazy",
        "selftext": "Hi all, I'm not really sure how to start so here I go.\n\nMom was diagnosed in Sept 2021 with rectal cancer, initially thought to be stage 1, possibly 2. She had a tumor the size of a smooshed golfball and had a bowel resection done. \n\nWe initially thought no ileostomy, chemo or radiation. After surgery she woke up with an ileostomy, was told she is stage 3 with cancer in a few lymphnodes. After a few setbacks she started chemo 5 FU in Feb, she has had 4 of a predicted 8 doses. \n\nHonestly she had really thrived with the chemo, felt good, got talkative and wanted to clean house. \n\nThen this past Wednesday she lost it. She lost hours of time, during which she made food and stashed it all over. Was really confused and thought it was strange she lost the time. Thursday she was mostly ok, but I called oncology and said we were worried it may be chemo brain, the dr said it didn't really sound it but take her to the ER for.eval. She refused that multiple times. I got an appt with her gp on Friday, and when I got there Friday she was really out of control, crying and upset. \n\nThe GP wanted her to get a CT in case if a TIA but she refused because she didnt want to go to a hospital. She was screaming and kicking in my car, and stuck repeating the same thing. It was a horrible day and a bad night. She slapped me and my brother, yanked my sis's hair, she never does this.\n\nSaturday she was normal! She was happy and herself, and even wanted to go out to lunch and watched movies. We thought maybe she was ok. \n\nSunday she was manic, just couldn't sit still, talked constantly, argued a lot. She has barely slept for days, and Monday am my sister said Mom was good at 5:30, acting like herself. An hour later I was racing to get there because she had wet the bed and was raving. I called her dr and she talked to the nurse who said call 911, and I did. \n\nNow Mom is in the hospital. CT and MRI do not show any signs of stroke or tumors, we are waiting to get results of urine tests and she is fighting a bladder scan. Her BP is crazy high, it's always high but it is really high, 230/70s, but has come down to 160/79.\n\nThe oncologist says this shouldn't be chemo related. The hospital says it very well could be. A couple of friends that had parents go through chemo said their family members suddenly did this, too.\n\nI am exhausted..My brother &amp; sister both are, too. So is Mom. I feel guilty calling 911 but she needed help we couldn't give at home. I don't know what we should do, Mom may be discharged tomorrow and is due for chemo friday. The dr wanted to delay a week last time but Mom wanted to push on.\n\nShe called me a dozen times in the night, called bro &amp; sis that many, I visited her today and she knows something is wrong with her but not what. We try to explain but she doesn't seem to process it right. She's scared, lonely and incredibly angry. I have her number muted so I can sleep but will hear if the hospital calls me. \n\nI don't know what else to do\n\nfuck\n\nthank you for listening\n\nupdate: Thank you so much for all the kind words and ideas. I'm too tired right now to reply to everyone individually.\n\nMom is still in the hospital, still raving. The hospital drs and her gp are strongly leaning to this being chemo induced. Friday's chemo is cancelled as of now because there is no way we can bring her. She is fighting getting meds, pills or access to iv. I don't know what will happen :(\n\nUpdate #2:  Mom has been in the hospital a week, she seemed ok yesterday and is off the wall today. Still no idea of the cause of all this. I visited yesterday &amp; today, she was almost herself yesterday but today she fought with me and an ostomy nurse for 2 hours about changing her ileostomy bag (it was failing) and she suddenly decided I could put it on then was happy. This is so wild",
        "upvote_ratio": 1.0,
        "ups": 20,
        "downs": 0,
        "score": 20
    },
    {
        "subreddit": "cancer",
        "title": "I'm almost all clear",
        "selftext": "PET scans came - lungs are clear, my main tumor is dead, and the new spot that worried my doctors (they thought it's a regional met) is most likely something that grew due to radiotherapy and isn't cancerous since it doesn't glow on scans/doesn't grow. \n\nOne more chemo to go, biopsy just to be sure, and then I'm all clear, I'll be taking oral chemo for a year but that's all.\n\nThe cancer got fucked!",
        "upvote_ratio": 1.0,
        "ups": 97,
        "downs": 0,
        "score": 97
    },
    {
        "subreddit": "cancer",
        "title": "Priest visit after diagnosis",
        "selftext": "Hey guys!\nMy brother was diagnosed with stomach cancer yesterday. He is going through additional testing today to see what stage. He has ascites and they have drained 7 litres of fluid from his stomach on Saturday, and then fluid starting filling up again yesterday. He's my big brother and I'm the only person he's shared this information with. I am unsure if he's telling me everything. Today, he mentioned that a priest and minister came to his hospital room yesterday to see how he is doing. I'm not sure why that would happen, unless it was very serious. Is that a typical occurrence for someone diagnosed with cancer? I feel like that would only happen if he was near end of life, but this is my first time going through this with anyone, so I'm not fully sure. I am concerned because it seems like he's dropping hints that it's bad and that he's not telling me everything. I just want to be there for him.",
        "upvote_ratio": 0.9,
        "ups": 15,
        "downs": 0,
        "score": 15
    },
    {
        "subreddit": "cancer",
        "title": "Guilt over ghosting people",
        "selftext": "My situation is highly atypical (strictly surgical case) and has been dragging on for 18 months now. I had one major liver surgery and have been preparing to get a liver transplant. My condition is still fluctuating though.  \n\nFor a year I did a decent job of keeping up with people in my life. I gave regular updates and still made an effort to talk to them. Everyone lauded me for having such a good sense of humor about it all. About six months ago I just hit a wall though. I started to become so depressed I couldn't bring myself to keep contact anymore. Some people have started reaching out, but I have a feeling most don't because they know something must be wrong and are giving me space. \n\nHow do you deal with the guilt from ghosting people? I feel so shitty and my self esteem has never been lower. I don't even need chemo or radiation. My life isn't in serious danger. The only symptoms I deal with are some gastric issues from having my gallbladder taken out and some very manageable neuropathy and muscular issues from the large abdominal incision. I see teenagers and people with much more serious, disruptive cancers soldiering on and I just feel paralyzed. I'm in my twenties and all of this happened right after graduating from college around the start of the pandemic. For a while, that was the rationale I leaned on - I was still coping with the newness of it all and this major surgery, and everything was shut down anyways, so of course I didn't have the bandwidth to think about anything else. After 18 months, what's my excuse? I feel ashamed that I haven't found a way to cope and move forward with my life despite my situation. \n\nI don't know how or when I'm going to talk to people again. I can't let this ghosting be permanent. The thought of reconnecting with people when I'm in this state of mind feels awful though, and I'm not sure if that'll change anytime soon.",
        "upvote_ratio": 1.0,
        "ups": 9,
        "downs": 0,
        "score": 9
    },
    {
        "subreddit": "cancer",
        "title": "Looking for some advice",
        "selftext": "Last week i went to the ER because I was having terrible pain in my chest every time I would swallow. I thought I had something lodged in my esophagus, turns out it’s a large mass surrounding my esophagus. They found nodules in my lungs too. :/ I am still awaiting biopsy results but they said it didn’t look great. It is extremely painful to eat or drink anything. Has anyone dealt with this before and found a way to get any type of nutrition? I’ll try anything at this point. :(",
        "upvote_ratio": 0.8,
        "ups": 8,
        "downs": 0,
        "score": 8
    },
    {
        "subreddit": "cancer",
        "title": "My dad had a \"stroke scan\" done and while doing so they found a 7cm mass on his liver.",
        "selftext": "I'm just scared. They have yet to do a biopsy as this was just discovered on Friday.  We don't know for sure that it's cancer but the way doctors want to take a look at it right away is scaring me. I'm not ready to lose my father. My mom is in bad shape and has enough trouble getting around as it is. \n\nI'm also nervous as I read that a biopsy can spread the cancer if it hasn't already spread. Just looking for some words of encouragement or any information that people could give who has gone through something similar.",
        "upvote_ratio": 0.78,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "My boyfriend of 7 years goes into his last chemo tomorrow after 14 rounds and 32 rounds of radiation and a surgery. He's finally NED and we're so close to the finish line. He recently shared with me that he would like to do something special to celebrate. Like a vacation. Any suggestions?",
        "selftext": "",
        "upvote_ratio": 0.97,
        "ups": 43,
        "downs": 0,
        "score": 43
    },
    {
        "subreddit": "cancer",
        "title": "What am I doing wrong?",
        "selftext": "I'm trying to keep busy and be as \"normal\" as I can be. I put myself together, meaning putting on makeup, dress nicely and don't complain about my pain. The bone cancer caused rib fractures and I powered through it, didn't even get pain meds. This seems to have worked for me until everyone needs me to do this and that and I'm pulled in different directions.\n\nEveryone says that I look great, no one would ever know that I'm terminally ill. I wonder if I've done myself a disservice. If I looked sick, maybe I wouldn't have to do anything for people here. But if I let myself go, I won't feel good about myself and that might harm me, first emotionally then physically.\n\nThings have to change, but I don't know what to do. I'm sure that others have experienced this, I need advice. Thank you in advance.\n\nEdit to clarify - My living situation is we are 3 adults and a 12 year old. My elderly father is 88, my brother is 62 and has Down Syndrome, my daughter is 34 and my granddaughter is 12. Unfortunately, I am the only one that drives. My dad has a hard time with me trying to explain to him how bad this is, he changes the subject quickly. Once in the car, I started to talk about it and he hurriedly says, \"Look! A Pizza Hut.\" My daughter is great at taking care of me. My granddaughter's bus comes at 6:15, but I get up and take her to school because that gives her an extra hour of sleep. I'd rather sleep since I'm always tired. \n\nMy best friend is a hypochondriac, which I just learned about 2 months ago. I have been walking her dog everyday, though I realize that she's healthier than me. Sometimes when I'm done walking her dog, I'm anxious to get home because I'm tired out and she'll tell me that she needs to run some errands, so here I go. Or I'll get home and my dad wants to go to Walmart or somewhere else, a haircut, the gas station to buy lottery scratchers.\n\nToday I was daydreaming that I was ok with just staying in my PJs and loaf the whole day. I cook dinner for my dad and brother almost everyday. There are days when my dad orders pizza or he'll walk a couple of blocks to Subway. I make it a point to thank him for making things easier for me.\n\nThank you all for your kind words and understanding of this situation. I appreciate you all. ♥️",
        "upvote_ratio": 0.92,
        "ups": 31,
        "downs": 0,
        "score": 31
    },
    {
        "subreddit": "cancer",
        "title": "Ugh",
        "selftext": "Been fighting some mystery illness ever since my first round of chemo. Have every symptom in the book: chills, fever, dizziness, diarrhea, my tongue swelled up, body aches, headache that won't go away, coughing, sneezing, bloody nose.......you name it, I have it. \n\nIn the emergency room right now and they're admitting me for a few days at the very least and starting me on a bunch of IV's for broad spectrum antibiotics. \n\nRound 2 of chemo is next week. \n\nThis is brutal. Never thought in a million years I'd be this sick and have a bunch of confused doctors. \n\nI'm still going to fight. \n\nJust found out I have neutropenia fever.\n\nRegularly the count is 4000-5000.  \nI'm at less than 100.",
        "upvote_ratio": 1.0,
        "ups": 16,
        "downs": 0,
        "score": 16
    },
    {
        "subreddit": "cancer",
        "title": "First day of chemotherapy",
        "selftext": "Started chemotherapy today any advice would help me or any word of encouragement to keep me going will be very helpful.",
        "upvote_ratio": 0.98,
        "ups": 61,
        "downs": 0,
        "score": 61
    },
    {
        "subreddit": "cancer",
        "title": "My life update",
        "selftext": "hello everyone i want to share part of my day with you i took the kids for treatment i went to the doctor i got new medication at the same time a description was made and no metastases were found\nHope you are fine too",
        "upvote_ratio": 1.0,
        "ups": 29,
        "downs": 0,
        "score": 29
    },
    {
        "subreddit": "cancer",
        "title": "Completing treatment as a teenager (16M)",
        "selftext": "Hi, I'm a 16 year old boy as the title says, and I'm completing my treatment of 3 years in June of this year.\n\nI was diagnosed with acute lymphoblastic leukemia at the age of 13, 4 days right after my 13th birthday on the 14th of February, 2019. I was undiagnosed for 4 - 5 months with major symptoms (Severe lower back pain, which progressed as the days passed, frequent infection, decreasing appetite, fatigue, loss of movement in the 3rd month, the ability to control my pee or my bowel movement.).\n\nAs I was undergoing treatment while going through puberty, I can say that my body hasn't completed its growth yet. I was on chemo for 8 whole months, and they really seemed to have stunted my growth in general. I still have hope that I might grow once I get off my medication.\n\nI turned 16 this year, and at the same time, I'm going to finish my treatment as well. I want to know the after effects of my treatment as my life progresses. I've read quite a lot of things about life after chemotherapy, but I want some feedback from a real person.\n\nI've been through chemo drugs, steroids and anti bacterial medicines. Steroids have affected me the worst. I hate them and their affects.\n\nI've been affected academically, due to chemo brain. I keep forgetting things, and don't have the interest to study. Maybe that's subjective to my lifestyle, but it is what it is. I'm a totally different person, I'm happy with who I am, but I definitely miss the younger me, who hadn't suffered this illness.\n\nI'm also concerned about things such as cancer returning back (relapse or a different cancer type), psychological effects without medication, other complications, and minor things.\n\nI'm also looking for a group to speak to about everything. When I was in the hospital, admitted in the paediatric ward, I didn't find anyone who was of my age. I only saw new born babies and toddlers in my ward. Not a single teenager or adolescent. My heart shattered when I found that out. There were almost 40+ small children in that ward, and watching them suffer at such a young age made me grief a lot. \n\nThank you",
        "upvote_ratio": 1.0,
        "ups": 14,
        "downs": 0,
        "score": 14
    },
    {
        "subreddit": "cancer",
        "title": "Loss after surgery",
        "selftext": "My Mom had surgery to remove her cancer successfully, but her body could not handle it and she passed on. She told me she had curable cancer a month ago. She said once the tumor was removed she was 100% fixed. We had less than a day between her surgery and her decline. \nI lost my Dad a year ago to pancreatic cancer less than 4 months after learning about it. \nMy mildly autistic brother had to be committed, because he was threatening himself, and me and my other siblings are just not capable of helping. We are 29,30,31,31 but my siblings all live at home. \nMom held us together after Dad. I have absolutely no idea what to do. I live 3 provinces over. I'm here now but what happens when I have to go back to work. Both parents in a year.\n\n****edit****I'm okay. We have so much love and support. My Dad's family was hands off and covid limited friends. My Mom's family is loving and generous and helpful. Her social circle is huge and caring. I do think my brother will do something drastic, but not now anyway. I am okay. Thank you for the love and support. Cancer is a bitch but we have the memories and love left behind.",
        "upvote_ratio": 0.98,
        "ups": 46,
        "downs": 0,
        "score": 46
    },
    {
        "subreddit": "cancer",
        "title": "What kind of follow up scans did you do after chemo?",
        "selftext": "I was diagnosed with paratesticular rhabdomyosarcoma that spread to the lymph nodes in December 2020 and finished treatment in December 2021. While I undergoing chemotherapy, my oncologist initially had me do both x-ray and CT scans. That was until I missed an appointment for a CT scan towards the end of my treatment and since then apparently they've have no longer been necessary. Now that I'm in remission I'm told a chest xray every 3 months is good enough. Is that normal? What was your experience like with follow up scans?",
        "upvote_ratio": 1.0,
        "ups": 6,
        "downs": 0,
        "score": 6
    },
    {
        "subreddit": "cancer",
        "title": "Mum's final moments. Need clarification.",
        "selftext": "My mum passed away almost 5 months ago from breast cancer. She had palliative care at home and during the final days, she was being given hydromorphone through an automatic driver and some additional shots of it were administered by me on the recommendation of the palliative nurses as they were only there once a day. I was also told to give her some other drug (can't remember the name) for her restlessness/agitation.\n\nA few days before her death she lost consciousness and right after she died white foam protruded from her mouth. I'm a little bit worried that she was given too much painkiller and as a result lost consciousness and foamed at the mouth after she died. The nurses said the foam was normal but I think they were just trying to ease my mind? Also, me and my sister got into an argument in front of her which was very dumb and mum was clearly upset and angry. Could this have lead to her losing consciousness earlier?\n\nI can't stop thinking about it lately, how I might've lessened her time with us. She was also pretty against the extra morphine but the palliative nurses pushed it and I didn't want her to suffer.\n\nI miss her so much she was my entire world and now I have nothing. Nothing matters anymore. It's getting harder not easier.",
        "upvote_ratio": 0.85,
        "ups": 9,
        "downs": 0,
        "score": 9
    },
    {
        "subreddit": "cancer",
        "title": "Mom has stage 4 squamous cell carcinoma but we know nothing, please help",
        "selftext": "My mom was diagnosed with stage 4 squamous cell carcinoma of the esophagus a few weeks ago after going in for an MRI of her back (and then receiving a PET scan and biopsy). It was a huge shock. The cancer has spread throughout her liver and bones and is causing a lot of pain in her chest, liver and spine.\n\nShe was given one round of chemo, and they essentially said it wasn’t curable but that they would be working to extend her life and give her some time where she feels good. This is all we know, and my parents won’t ask anything else. \n\nI’m wondering if anyone is familiar with this cancer and has a similar experience to share or any advice. The not knowing is really tough, but I’m also confused because I’ve read that squamous cell carcinoma spreads slowly. My mom just had multiple scans and procedures done last year, and none of this cancer was present then. We know absolutely that hers is spreading very fast, and even her doctors are dumbfounded.\n\nHelp!",
        "upvote_ratio": 1.0,
        "ups": 19,
        "downs": 0,
        "score": 19
    },
    {
        "subreddit": "cancer",
        "title": "Do any of you long term patients feel like your life revolves around a disease?",
        "selftext": "Little backstory: I’m 29M and was first diagnosed in 2006 with osteosarcoma. I felt then that I was kind of the “Chemo” kid. 10 years later I was 24yo and I relapsed in 2016 with a localized tumor. I did my chemo and thought okay it’s got to be over. In 2018, I relapsed again. In 2019, I relapsed again but this time with lung Mets. So now it’s 2022 and on Wednesday I had kidney surgery to remove a secondary tumor that isn’t osteosarcoma. Im 29 and on my second malignancy and it feels hard to move forward with life. I’ve been on disability since 2016 while I finished college but with all the relapses, I’ve stayed on it.  My friends are moving forward and my relationship is being strained because I live with my parents but it’s necessary because I have one leg that barely works due to limb sparing surgery. My parents just installed a lift so I don’t have to use the steps. This week has been weird because I’m usually super up beat and positive and I still am. Im just having a bad week I think. I love life and I’m glad I’m alive. Just wondering if others feel the same sometimes? I often remind myself that someone some where has it way worse than I do.",
        "upvote_ratio": 0.99,
        "ups": 71,
        "downs": 0,
        "score": 71
    },
    {
        "subreddit": "cancer",
        "title": "Trying to understand what happened to my mom’s brain in her last months with GBM/what a “normal” response is to her death less than a year out",
        "selftext": "32-year-old, somewhat single male. (Every therapist I’ve spoken to about my mom’s death has immediately asked me if I have a partner in whom I can confide. I returned to my ex because she is still in love with me, provides comfort, and talks to me about memories involving my mom; she’s great, just not the one, and I don’t know how to break up with someone who remembers parts of my mom better than I do.)\n\nAnyway, can anyone please point me in the direction of what a person’s psychological condition is like when in the final months of GBM, or cancer in general? Going off that, what psychological behaviors and thoughts are typical in family members who lost a loved one to cancer — especially those who served as primary caregivers, and watched the decline? I would love to read a book, either personal or academic, about these situations. \n\nThe closest I’ve gotten is Biden’s “Promise Me, Dad,” which felt intentionally … concealed, at times. Thanks in advance.",
        "upvote_ratio": 0.78,
        "ups": 5,
        "downs": 0,
        "score": 5
    },
    {
        "subreddit": "cancer",
        "title": "What foods are good to eat while going through chemo?",
        "selftext": "One of my dear friends is in the hospital with leukaemia. Doctors are hopeful he’ll be outpatient soon and his sister will be taking care of him. I want to make some freezer meals his sister can just heat up or pop in the oven.\n\nAny suggestions of what would be easy to eat while going through chemo?\nMy first thought was chicken noodle soup, but would love some more suggestions.\n\nThank you all so much ❤️",
        "upvote_ratio": 1.0,
        "ups": 15,
        "downs": 0,
        "score": 15
    },
    {
        "subreddit": "cancer",
        "title": "Athlete and chemo",
        "selftext": "Hi, \nI was diagnosed w a rare form of ovarian cancer at 23. Fortunately, they removed the whole tumor, but I still have to have another surgery to remove the ovary and go through chemo. I’m an extremely active person. Weightlifting, aerial arts and flexibility. Just wanted to hear from other athletes what their experience was with chemo. \n\nIs it unrealistic to think that I will have some energy to train at smaller scale? \n\nHow did you cope with not being able to do what you love doing? \n\nHow did you recover and how long did it take? \n\nI’ve just personally put soooo much value into my athletic ability and strength. I never thought it would be taken away from me like this. I know it’s not permanent, but it still hurts :(",
        "upvote_ratio": 0.93,
        "ups": 20,
        "downs": 0,
        "score": 20
    },
    {
        "subreddit": "cancer",
        "title": "MUSC Hollings cancer center?",
        "selftext": "Can anybody share their experience with them ?  My particular interest is male GU cancer.",
        "upvote_ratio": 1.0,
        "ups": 1,
        "downs": 0,
        "score": 1
    },
    {
        "subreddit": "cancer",
        "title": "My 4 year old son has leukemia",
        "selftext": "He was diagnosed with a rare form of leukemia that forms a tumor. They removed a large tumor in his chest and he is now finishing his first round of chemo. He’s doing really well considering. Good spirits, good energy, good appetite so far. \nThe hardest part is not knowing any sort of prognosis or how well the treatment is working. I am very hopeful but can’t stand the thought of loosing him. He is such a sweet, intelligent kid. \n\nWe also have a 2 year old who is not allowed in the hospital because of covid. This means one of us watches the 2 year old and one of us stays at the hospital. We are 7 hours from home and neither of us has worked in 2 months. This is our life now. \n\nWe have received huge financial support from our family and community, so we are good there at least for the next few months. \n\nI’m not really sure why i am sharing all this but reading some other stories on here has helped me get a little perspective in the cancer world. \n\nThis is by far the worst thing that has ever happened to either of us. If i could take his place I would do it in a heartbeat.",
        "upvote_ratio": 0.99,
        "ups": 96,
        "downs": 0,
        "score": 96
    },
    {
        "subreddit": "cancer",
        "title": "Useful resources for cancer patients",
        "selftext": "Anyone have good places for financial support during treatment? I live in florida and last time I went through chemo was during covid so i was getting those stimulus checks, now thats over I might need some support. If anyone knows good government or charity resources I'd appreciate it :)",
        "upvote_ratio": 1.0,
        "ups": 6,
        "downs": 0,
        "score": 6
    },
    {
        "subreddit": "cancer",
        "title": "conflicted with a \"good\" pet scan results",
        "selftext": "My most recent pet scan showed resolution of all but the original tumor. The uptake from the previous scan was 42, now it's 5.9.  I know that's a good result from chemo and radiation. I can't seem to get past the thought that I still have some cancer. Then I feel guilty for not celebrating the good news.   I want to go back to work, but I sleep 14 hours a day, have no strength, and still vomit 3 or more times per week randomly, and I'm still taking opioid pain killers.  Other than that I'm doing great.",
        "upvote_ratio": 1.0,
        "ups": 16,
        "downs": 0,
        "score": 16
    },
    {
        "subreddit": "cancer",
        "title": "Advice: my neighbors are a couple that smoke cigarettes almost everyday and their door is right next to ours",
        "selftext": "One of my chemo drugs is damaging to my lungs. I’m not in the wrong for asking if they could walk a couple feet forward and smoke away from our doorstep right? It’s for my health. And I would ask politely of course. And i’m already keeping my fan on and closing my door etc. Just wanted a sanity check.",
        "upvote_ratio": 0.92,
        "ups": 10,
        "downs": 0,
        "score": 10
    },
    {
        "subreddit": "cancer",
        "title": "My throat cancer journey as told through text messages between me and my two sisters [OC]",
        "selftext": "",
        "upvote_ratio": 1.0,
        "ups": 24,
        "downs": 0,
        "score": 24
    },
    {
        "subreddit": "cancer",
        "title": "I found out I have cancer at 22",
        "selftext": "I recently got diagnosed with lymphoma cancer and I know it sounds bad but in the time I had to process the news I learned a lot. \n\nFor example that there are some cancers that are very horrible to the people experiencing it and are indeed deadly, there’s also some type of cancers that have a high survival + recovery rate. However I’ve noticed that people respond really dramatically to me having a curable type of cancer. They’re all acting like I’m going to die which is annoying because I’ve been closer to death bc of my mental health issues and nobody was there to help me back then so this all feels fake (Ik how it sounds and idc) + it’s already hard for me to stay positive.\n\nI know that all of these people are just scared that they’ll lose me but I wish I had the chance to explain how curable it is and that I feel okay before they start acting like I’m going to die. It’s very draining for me to have to compensate by being overly positive about it when I don’t want to bc I’m not looking forward to any of it but shit happens and I’ll come out even stronger.\n\nMy point is I feel like not telling anybody anymore about me having cancer but at the same time I hate how suddenly everybody knows how to be nice when they think someone’s struggling. Why can’t people be nice without me having a sickness that is known to kill?",
        "upvote_ratio": 0.97,
        "ups": 32,
        "downs": 0,
        "score": 32
    },
    {
        "subreddit": "cancer",
        "title": "why would I have to wait a month for a biopsy?",
        "selftext": "My Brother is having a Biopsy to check for prostate cancer.  He is really nervous considering he has to wait a month to have it done.\n\nI didn't know what to say to him about the wait and I'm just wondering if this is normal to have to wait this long for a test of this magnitude?",
        "upvote_ratio": 0.83,
        "ups": 4,
        "downs": 0,
        "score": 4
    }
]